### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [111]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "HeroesOfPymoli/Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_df = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [112]:
Total_players=purchase_data['SN'].unique()
Total=len(Total_players)
Total_df=pd.DataFrame({'Total Players':[Total]})
Total_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [113]:
# peaking at the data for analysis
purchase_df.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [114]:
# peaking at the data for analysis
purchase_data.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   91.755128    3.050987
std     225.310896    6.659444   52.697702    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   47.750000    1.980000
50%     389.500000   22.000000   92.000000    3.150000
75%     584.250000   25.000000  138.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [115]:
Items=len(purchase_data['Item ID'].unique())
Avg_Price=purchase_data['Price'].mean()
Purchases=len(purchase_data['Purchase ID'].unique())
Total_price=purchase_data['Price'].sum()



Summary_df=pd.DataFrame({'Unique Items':[Items], 'Average_Price':[Avg_Price], 
              'Num of Purchases': [Purchases], 'Total Paid':[Total_price]})
Summary_df['Average_Price']=Summary_df['Average_Price'].map("${:.2f}".format)
Summary_df['Total Paid']=Summary_df['Total Paid'].map("${:.0f}".format)

Summary_df.set_index('Num of Purchases')

                  Unique Items Average_Price Total Paid
Num of Purchases
780                        179         $3.05      $2380

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [116]:
purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [117]:
purchase_df_male=purchase_df.loc[purchase_df['Gender']=='Male',:]
Num_Males=len(purchase_df_male['SN'].unique())
print(Num_Males)

purchase_df_female=purchase_df.loc[purchase_df['Gender']=='Female',:]
Num_Females=len(purchase_df_female['SN'].unique())
print(Num_Females)

purchase_df_other_1=purchase_df.loc[purchase_df['Gender']!='Female',:]
purchase_df_other_2=purchase_df_other_1.loc[purchase_df_other_1['Gender']!='Male',:]
Num_Other=len(purchase_df_other_2['SN'].unique())
print(Num_Other)

484
81
11

In [118]:
fraction_m=Num_Males/Total_df['Total Players']
fraction_f=Num_Females/Total_df['Total Players']
fraction_o=Num_Other/Total_df['Total Players']

m_per = "{:.0%}".format(fraction_m[0])
f_per = "{:.0%}".format(fraction_f[0])
o_per = "{:.0%}".format(fraction_o[0])

gender_dict=[{'% Male Players':m_per},{'% Female Players':f_per},{'% Other Players':o_per}]
gender_dict

gender_dict={
    'Total Count':[Num_Males,Num_Females,Num_Other],
    'Percentage of Players':[m_per,f_per,o_per]
    }

percent_df=pd.DataFrame(gender_dict)
percent_df

   Total Count Percentage of Players
0          484                   84%
1           81                   14%
2           11                    2%

In [119]:
ix=pd.Series(['Male','Female','Other/Non-Disclosed'])
percent_df.set_index([ix])

                     Total Count Percentage of Players
Male                         484                   84%
Female                        81                   14%
Other/Non-Disclosed           11                    2%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [125]:
purchase_df_group=purchase_df.groupby(['Gender'])
Purchase_Count_g=purchase_df_group['Purchase ID'].count()

Purchase_Count_g.head()

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [129]:
Avg_Price_g=purchase_df_group['Price'].mean()
Avg_Price_g.head()

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [164]:
Total_Price_g=purchase_df_group['Price'].sum()
Total_Price_g.head()

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [176]:
Summary_Gender_df=pd.DataFrame({
    "Purchase Count":Purchase_Count_g,
    "Avg. purchase price":Avg_Price_g,
    "Purchase total": Total_Price_g,
    'Unique Users':[Num_Females,Num_Males,Num_Other]
})

In [177]:
Summary_Gender_df["Per Person Avg"]=Summary_Gender_df["Purchase total"]/Summary_Gender_df['Unique Users']

In [178]:
Summary_Gender_df["Avg. purchase price"] = Summary_Gender_df["Avg. purchase price"].map("${:.2f}".format)
Summary_Gender_df["Purchase total"] = Summary_Gender_df["Purchase total"].map("${:.2f}".format)
Summary_Gender_df["Per Person Avg"] = Summary_Gender_df["Per Person Avg"].map("${:.2f}".format)
Summary_Gender_df

,Purchase Count,Avg. purchase price,Purchase total,Unique Users,Per Person Avg
Gender,,,,,
Female,113,$3.20,$361.94,81,$4.47
Male,652,$3.02,$1967.64,484,$4.07
Other / Non-Disclosed,15,$3.35,$50.19,11,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [191]:
age_purchase_df=purchase_df.copy()

In [192]:
bins=[0,10,15,20,25,30,35,40,150]
labels=['<10','10-14','15-19','20-24','25-29','30-34','35-40','40+']

In [193]:
age_purchase_df['Age Summary']=pd.cut(age_purchase_df['Age'],bins,labels=labels,include_lowest=True, right=False)
age_purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Summary
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [204]:
age_grouped=age_purchase_df.groupby(['Age Summary'])
age_grouped.nunique()

             Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age Summary
<10                   23   17    3       2       21         21     21
10-14                 28   22    5       2       24         24     24
15-19                136  107    5       3       96         96     83
20-24                365  258    5       3      163        163    135
25-29                101   77    5       3       78         78     73
30-34                 73   52    5       2       60         60     56
35-40                 41   31    5       3       37         37     34
40+                   13   12    6       2       13         13     13

In [207]:
Summarypercent_age=age_grouped['Purchase ID'].nunique()
Summarypercent_age_df=pd.DataFrame(Summarypercent_age)

In [208]:
Summarypercent_age_df = Summarypercent_age_df.rename(columns={
    'Purchase ID':'Total Purchases'
     })

In [210]:
Summarypercent_age_df['Percent of Total']=Summarypercent_age_df['Total Purchases']/Summarypercent_age_df['Total Purchases'].sum()
Summarypercent_age_df['Percent of Total']= Summarypercent_age_df['Percent of Total'].map("{:.0%}".format)
Summarypercent_age_df

             Total Purchases Percent of Total
Age Summary
<10                       23               3%
10-14                     28               4%
15-19                    136              17%
20-24                    365              47%
25-29                    101              13%
30-34                     73               9%
35-40                     41               5%
40+                       13               2%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [200]:
Purchase_Count_a=age_grouped['Purchase ID'].count()
Avg_Price_a=age_grouped['Price'].mean()
Total_Price_a=age_grouped['Price'].sum()
Unique_Users_a=age_grouped['SN'].nunique()


Summary_Age_df=pd.DataFrame({
    "Purchase Count":Purchase_Count_a,
    "Avg. purchase price":Avg_Price_a,
    "Purchase total": Total_Price_a,
    "Unique Users": Unique_Users_a
})

Summary_Age_df

             Purchase Count  Avg. purchase price  Purchase total  Unique Users
Age Summary
<10                      23             3.353478           77.13            17
10-14                    28             2.956429           82.78            22
15-19                   136             3.035956          412.89           107
20-24                   365             3.052219         1114.06           258
25-29                   101             2.900990          293.00            77
30-34                    73             2.931507          214.00            52
35-40                    41             3.601707          147.67            31
40+                      13             2.941538           38.24            12

In [202]:
Summary_Age_df["Per Person Avg"]=Summary_Age_df["Purchase total"]/Summary_Age_df['Unique Users']
Summary_Age_df

,Purchase Count,Avg. purchase price,Purchase total,Unique Users,Per Person Avg
Age Summary,,,,,
<10,23,3.353478,77.13,17,4.537059
10-14,28,2.956429,82.78,22,3.762727
15-19,136,3.035956,412.89,107,3.858785
20-24,365,3.052219,1114.06,258,4.318062
25-29,101,2.900990,293.00,77,3.805195
30-34,73,2.931507,214.00,52,4.115385
35-40,41,3.601707,147.67,31,4.763548
40+,13,2.941538,38.24,12,3.186667

In [203]:
Summary_Age_df["Avg. purchase price"] = Summary_Age_df["Avg. purchase price"].map("${:.2f}".format)
Summary_Age_df["Purchase total"] = Summary_Age_df["Purchase total"].map("${:.2f}".format)
Summary_Age_df["Per Person Avg"] = Summary_Age_df["Per Person Avg"].map("${:.2f}".format)
Summary_Age_df

,Purchase Count,Avg. purchase price,Purchase total,Unique Users,Per Person Avg
Age Summary,,,,,
<10,23,$3.35,$77.13,17,$4.54
10-14,28,$2.96,$82.78,22,$3.76
15-19,136,$3.04,$412.89,107,$3.86
20-24,365,$3.05,$1114.06,258,$4.32
25-29,101,$2.90,$293.00,77,$3.81
30-34,73,$2.93,$214.00,52,$4.12
35-40,41,$3.60,$147.67,31,$4.76
40+,13,$2.94,$38.24,12,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [224]:
top_purchase_df=purchase_df.copy()

In [227]:
top_SN_group=top_purchase_df.groupby(['SN'])

In [239]:
top_SN_df = pd.DataFrame(top_SN_group.sum().sort_values(['Price'],ascending=False))
top_spend_df = pd.DataFrame(top_SN_df.iloc[0:5,3])
top_spend_df = top_spend_df.rename(columns={'Price':'Total Purchase Value'})
top_spend_df

             Total Purchase Value
SN
Lisosia93                   18.96
Idastidru52                 15.45
Chamjask73                  13.83
Iral74                      13.62
Iskadarya95                 13.10

In [240]:
counts_for_top=top_SN_group.nunique()
counts_for_top

               Purchase ID  Age  Gender  Item ID  Item Name  Price
SN
Adairialis76             1    1       1        1          1      1
Adastirin33              1    1       1        1          1      1
Aeda94                   1    1       1        1          1      1
Aela59                   1    1       1        1          1      1
Aelaria33                1    1       1        1          1      1
...                    ...  ...     ...      ...        ...    ...
Yathecal82               3    1       1        3          3      3
Yathedeu43               2    1       1        2          2      2
Yoishirrala98            1    1       1        1          1      1
Zhisrisu83               2    1       1        2          2      2
Zontibe81                3    1       1        3          3      3

[576 rows x 6 columns]

In [241]:
top_merge_df=pd.merge(top_spend_df,counts_for_top,on='SN',how='inner')

In [242]:
top_merge_df = top_merge_df.rename(columns={'Purchase ID':'Purchase Count'})
top_merge_df

,Total Purchase Value,Purchase Count,Age,Gender,Item ID,Item Name,Price
SN,,,,,,,
Lisosia93,18.96,5,1,1,5,5,5
Idastidru52,15.45,4,1,1,4,4,4
Chamjask73,13.83,3,1,1,3,3,3
Iral74,13.62,4,1,1,4,4,4
Iskadarya95,13.10,3,1,1,3,3,3

In [247]:
top_merge_df['Average Purchase Price']=top_merge_df['Total Purchase Value']/top_merge_df['Purchase Count']
top_merge_df['Average Purchase Price']=top_merge_df['Average Purchase Price'].map("${:.2f}".format)
top_merge_df['Total Purchase Value']=top_merge_df['Total Purchase Value'].map("${:.2f}".format)
top_merge_df_final=top_merge_df[['Purchase Count','Average Purchase Price','Total Purchase Value']]
top_merge_df_final

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [284]:
pop_purchase_df=purchase_df.copy()
pop_purchase_df.head(1)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53

In [324]:
pop_item_group=pop_purchase_df.groupby(['Item ID'])

In [333]:
# pop_Name_df=pop_purchase_df.set_index(['Item ID'])
# pop_Name_df=pd.DataFrame(pop_Name_df['Item Name'])
# pop_Name_df.head()

In [334]:
pop_item_df = pd.DataFrame(pop_item_group.nunique().sort_values(['Purchase ID'],ascending=False))
pop_five_df = pd.DataFrame(pop_item_df.iloc[0:5,0])
pop_five_df = pop_five_df.rename(columns={'Purchase ID':'Purchase Count'})
pop_five_df

         Purchase Count
Item ID
92                   13
178                  12
145                   9
132                   9
108                   9

In [335]:
pop_five_df_total=pop_item_group.sum()
pop_five_df_total=pop_five_df_total.rename(columns={'Price':'Total Purchase Value'})
pop_five_df_total

         Purchase ID  Age  Total Purchase Value
Item ID
0               1149   74                  5.12
1               1523   89                 11.77
2               2006  143                 14.88
3               2087  155                 14.94
4               1885  124                  8.50
...              ...  ...                   ...
178             4960  287                 50.76
179             1948  126                 26.88
181             1278  109                  8.30
182             1327   67                 12.09
183             1488   66                  3.27

[179 rows x 3 columns]

In [322]:
pop_merge_df=pd.merge(pop_five_df,pop_five_df_total,on='Item ID',how='inner')
pop_merge_df=pop_merge_df[['Purchase Count','Total Purchase Value']]
pop_merge_df

         Purchase Count  Total Purchase Value
Item ID
92                   13                 59.99
178                  12                 50.76
145                   9                 41.22
132                   9                 28.99
108                   9                 31.77

In [323]:
# pop_merge2_df=pd.merge(pop_merge_df,pop_purchase_itemIX_df,on='Item ID',how='outer')
# pop_merge2_df=pop_merge2_df.dropna(how='any')
# pop_merge2_df

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80